In [10]:
import pandas as pd
import numpy as np

In [11]:
df = pd.read_csv('lalle.csv')

In [12]:
df.head()

       Name  Salary  Age
0   Katrina   20000   24
1   Kareena   30000   56
2  Priyanka   10000   42
3     Kajol  300000   34

In [15]:
df[df['Salary'] > 10000]

      Name  Salary  Age
0  Katrina   20000   24
1  Kareena   30000   56
3    Kajol  300000   34

In [16]:
df['Salary'].max()

300000

In [17]:
df['Salary'].describe()

count         4.00000
mean      90000.00000
std      140237.89312
min       10000.00000
25%       17500.00000
50%       25000.00000
75%       97500.00000
max      300000.00000
Name: Salary, dtype: float64

In [18]:
df['Salary'] > 15000

0     True
1     True
2    False
3     True
Name: Salary, dtype: bool

In [19]:
df[df['Salary'] > 10000]

      Name  Salary  Age
0  Katrina   20000   24
1  Kareena   30000   56
3    Kajol  300000   34